import React from 'react'

const Ecmascript = () => {
    return (
        <>
            {/* 
                <ECMAScript>
                = European Computer Manufacturers Association Script : 유럽 컴퓨터 제조업체 협회 스크립트
                = '구글 크롬'이나 '마이크로소프트 에지'같은 브라우저에서 동작하는 언어
                = 지금은 전 세계가 자바스크립트를 사용하고 있기 때문에 마음대로 기능을 추가해서는 안되므로 'ECMAScript'라는 표준을 만들어서 그 안에서 기능을 추가하고 있다
                = 자바스크립트라는 언어가 어떤 문법과 기능을 가져야 하는지를 정의한 표준 문서
                = 자바스크립트의 사용 설명서

                <자바스크립트의 역사>
                = 1995년 넷스케이프의 브렌던 아이크가 모질라 프로젝트의 일환으로 개발
                = '자바'가 큰인기를 얻었고 그 영향으로 1995년에 '자바스크립트'라는 이름으로 변경
                = 1996년 마이크로소프트가 자사의 인터넷 익스플로러에 자바스크립트를 도입
                = 1997년 ECMA-262라는 표준이 제정되면서 자바스크립트의 공식적인 명칭이 ECMAScript로 변경
                = 2009년 ECMAScript 5(ES5) 발표
                = 2015년 ECMAScript 6(ES6) 발표

                <ECMAScript 명칭>
                = 'ECMAScript'라는 이름은 '자바스크립트'의 공식적인 표준 명칭으로 사용된다
                = 'ECMAScript'는 자바스크립트의 문법과 기능을 정의한 표준 문서이다
                ES6 = ES2015
                ES7 = ES2016
                -> 연도를 붙이는 방식으로 변경

                <근대 자바스크립트 전환기>
                = 근대 자바스크립트의 전환기라고 불릴 만큼 ECMAScript가 크게 개정된 버전은 'ES2015(ES6)'이다
                = 2015년에 기능이 대거 추가되며 리액트 등 모던 자바스크립트 개발에 필수라할 수 있는 문법이나 기능이 더해졌다
                [추가 사양 일부]
                화살표함수, Class구문, 분할대입, 템플릿 문자열, 스프레드 구문, Promise,.let, const 등
            */}
        </>
    )
}

export default Ecmascript